app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Artikel';
        $a = $this->request->getVar('a') ?? '';
        $model = new ArtikelModel();
        $data = [
        'title' => $title,
        'a' => $a,
        'artikel' => $model->like('judul', $a)->paginate(5), # data
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'